package com.tony.proto;

public class Proto {
    // 索引对齐，同位索引算法
    // 第一个表示通道号，第二个表示故障还是报警（1报警，2故障），第三个表示故障类型（电压4，电流3，，温度2，漏电流1）
    // 故障低字
    public static String[][] FAULTL = {
            {"4","2","3","电流过载故障"},
            {"3","2","3","电流过载故障"},
            {"2","2","3","电流过载故障"},
            {"1","2","3","电流过载故障"},

            {"4","2","4","电压中断故障"},
            {"3","2","4","电压中断故障"},
            {"2","2","4","电压中断故障"},
            {"1","2","4","电压中断故障"},

            {"4","2","2","温度通道故障"},
            {"3","2","2","温度通道故障"},
            {"2","2","2","温度通道故障"},
            {"1","2","2","温度通道故障"},

            {"4","2","1","剩余电流故障"},
            {"3","2","1","剩余电流故障"},
            {"2","2","1","剩余电流故障"},
            {"1","2","1","剩余电流故障"}
    };
    // 报警标志报文
    public static String[][] ALARM = {
            {"4","1","0","保留位"},
            {"3","1","0","保留位"},
            {"2","1","0","保留位"},
            {"1","1","0","保留位"},

            {"4","1","0","保留位"},
            {"3","1","0","保留位"},
            {"2","1","0","保留位"},
            {"1","1","0","保留位"},

            {"4","1","2","温度通道报警"},
            {"3","1","2","温度通道报警"},
            {"2","1","2","温度通道报警"},
            {"1","1","2","温度通道报警"},

            {"4","1","1","剩余电流报警"},
            {"3","1","1","剩余电流报警"},
            {"2","1","1","剩余电流报警"},
            {"1","1","1","剩余电流报警"}
    };
    // 实时上报报文-协议中值的存放顺序
    public static String[] FIELDS = {"electricity","leakageCurrent","temperature"};
    //

}
